LedgerHQ/blue-nonsecure-firmware/build/stm32l476/src/usbd_conf.c
io_usb_hid_receive_status_t io_usb_hid_receive (io_send_t sndfct, unsigned char* buffer, unsigned short l) {

  // avoid over/under flows
  memset(G_io_hid_chunk, 0, sizeof(G_io_hid_chunk));
  memcpy(G_io_hid_chunk, buffer, MIN(l, sizeof(G_io_hid_chunk)));

  // process the chunk content
  switch(G_io_hid_chunk[2]) {
  case 0x05:
    // ensure sequence idx is 0 for the first chunk ! 
    if (G_io_hid_chunk[3] != (G_io_usb_hid_sequence_number>>8) || G_io_hid_chunk[4] != (G_io_usb_hid_sequence_number&0xFF)) {
      // ignore packet
      goto apdu_reset;
    }
    // cid, tag, seq
    l -= 2+1+2;
    
    // append the received chunk to the current command apdu
    if (G_io_usb_hid_sequence_number == 0) {
      /// This is the apdu first chunk
      // total apdu size to receive
      G_io_usb_hid_total_length = (G_io_hid_chunk[5]<<8)+(G_io_hid_chunk[6]&0xFF);
      // check for invalid length encoding (more data in chunk that announced in the total apdu)
      if (G_io_usb_hid_total_length > sizeof(G_io_apdu_buffer)) {
        goto apdu_reset;
      }
      // seq and total length
      l -= 2;
      // compute remaining size to receive
      G_io_usb_hid_remaining_length = G_io_usb_hid_total_length;
      G_io_usb_hid_current_buffer = G_io_apdu_buffer;

      if (l > G_io_usb_hid_remaining_length) {
        l = G_io_usb_hid_remaining_length;
      }
      // copy data
      memcpy(G_io_usb_hid_current_buffer, G_io_hid_chunk+7, l);
    }
    else {
      // check for invalid length encoding (more data in chunk that announced in the total apdu)
      if (l > G_io_usb_hid_remaining_length) {
        l = G_io_usb_hid_remaining_length;
      }

      /// This is a following chunk
      // append content
      memcpy(G_io_usb_hid_current_buffer, G_io_hid_chunk+5, l);
    }
    // factorize (f)
    G_io_usb_hid_current_buffer += l;
    G_io_usb_hid_remaining_length -= l;
    G_io_usb_hid_sequence_number++;
    break;

  case 0x00: // get version ID
    // do not reset the current apdu reception if any
    memset(G_io_hid_chunk+3, 0, 4); // PROTOCOL VERSION is 0
    // send the response
    sndfct(G_io_hid_chunk, IO_HID_EP_LENGTH);
    // await for the next chunk
    goto apdu_reset;

  case 0x01: // ALLOCATE CHANNEL
    // do not reset the current apdu reception if any
    memset(G_io_hid_chunk+3, 0, 4);
    // send the response
    sndfct(G_io_hid_chunk, IO_HID_EP_LENGTH);
    // await for the next chunk
    goto apdu_reset;

  case 0x02: // ECHO|PING
    // do not reset the current apdu reception if any
    // send the response
    sndfct(G_io_hid_chunk, IO_HID_EP_LENGTH);
    // await for the next chunk
    goto apdu_reset;
  }

  // if more data to be received, notify it
  if (G_io_usb_hid_remaining_length) {
    return IO_USB_APDU_MORE_DATA;
  }

  // reset sequence number for next exchange
  io_usb_hid_init();
  return IO_USB_APDU_RECEIVED;

apdu_reset:
  io_usb_hid_init();
  return IO_USB_APDU_RESET;
}

unsigned short io_usb_hid_exchange(io_send_t sndfct, unsigned short sndlength,
                                   unsigned char flags) {
  unsigned char l;

  // perform send
  if (sndlength) {
    G_io_usb_hid_sequence_number = 0; 
    G_io_usb_hid_current_buffer = G_io_apdu_buffer;
    // consume previous command apdu
    G_io_apdu_length = 0;
    while(sndlength) {

      // fill the chunk
      memset(G_io_hid_chunk+2, 0, IO_HID_EP_LENGTH-2);

      // keep the channel identifier
      G_io_hid_chunk[2] = 0x05;
      G_io_hid_chunk[3] = G_io_usb_hid_sequence_number>>8;
      G_io_hid_chunk[4] = G_io_usb_hid_sequence_number;

      if (G_io_usb_hid_sequence_number == 0) {
        l = ((sndlength>IO_HID_EP_LENGTH-7) ? IO_HID_EP_LENGTH-7 : sndlength);
        G_io_hid_chunk[5] = sndlength>>8;
        G_io_hid_chunk[6] = sndlength;
        memcpy(G_io_hid_chunk+7, G_io_usb_hid_current_buffer, l);
        G_io_usb_hid_current_buffer += l;
        sndlength -= l;
        l += 7;
      }
      else {
        l = ((sndlength>IO_HID_EP_LENGTH-5) ? IO_HID_EP_LENGTH-5 : sndlength);
        memcpy(G_io_hid_chunk+5, G_io_usb_hid_current_buffer, l);
        G_io_usb_hid_current_buffer += l;
        sndlength -= l;
        l += 5;
      }
      // prepare next chunk numbering
      G_io_usb_hid_sequence_number++;

      // this is the last chunk to be sent
      if (!sndlength) {
        // prepare for next apdu
        io_usb_hid_init();     
		G_io_apdu_length = 0;   
      }

      // always pad :)
      // send the chunk
      sndfct(G_io_hid_chunk, sizeof(G_io_hid_chunk));
    }
  }

  if (flags & IO_RESET_AFTER_REPLIED) {
    NVIC_SystemReset();
  }

  if (flags & IO_RETURN_AFTER_TX ) {
    return 0;
  }

  return G_io_apdu_length;
}


extern USBD_HandleTypeDef USBD_Device;
void io_usb_send_apdu_data(unsigned char* buffer, unsigned short length) {
  USBD_LL_Transmit(&USBD_Device, 0x82, buffer, length);
}

int8_t CUSTOM_HID_OutEvent  (uint8_t* hid_report)
{ 
  if (hid_report) {
    // add to the hid transport
    switch(io_usb_hid_receive(io_usb_send_apdu_data, G_io_usb.ep_out_buff[2], hpcd_USB_OTG_FS.OUT_ep[2].xfer_count)) {
      default:
        break;

      case IO_USB_APDU_RECEIVED:
        G_io_apdu_length = G_io_usb_hid_total_length;
        break;
    }
  }
  return (0);
}


unsigned short io_exchange(unsigned char channel_and_flags, unsigned short tx_length) {
  return io_usb_hid_exchange(io_usb_send_apdu_data, tx_length, channel_and_flags);
}

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
